let a = +prompt(`Введите  первую длину стороны треугольнкика`);
let b = +prompt(`Введите  вторую длину стороны треугольнкика`);
let c = +prompt(`Введите  третью длину стороны треугольнкика`);

if ((a != b) && (a != c) && (b != c)) {
    console.log(`Разносторонний`);
} else if ((a === b) && (b === c) && (c === a)) {
    console.log(`Равносторонний`);
} else if (((a === b) && (a != c) && (b != c)) || ((b === c) && (b != a) && (c != a)) || ((a === c) && (c != b)(a = !b))) {
    console.log(`Равнобедренный`);
}